#Написать программу не используя условный оператор. На экран вывести TRUE или FALSE. Целое k является трехзначным числом, кратным пяти
print ("Введите число")
k = int(input())
print(99< k <1000 and k % 5 == 0)#Проверка условия
